OpenFOAM/reatorWALE_refined/system/blockMeshDict
//
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	blockMeshDict;
}
convertToMeters	1;
edges	
(
);
vertices	
(
	(-0.028016 -0.027055 -0.01818)
	(0.028016 -0.027055 -0.01818)
	(0.028016 0.048945 -0.01818)
	(-0.028016 0.048945 -0.01818)
	(-0.028016 -0.027055 0.01818)
	(0.028016 -0.027055 0.01818)
	(0.028016 0.048945 0.01818)
	(-0.028016 0.048945 0.01818)
);
blocks	
(
	hex (0 1 2 3 4 5 6 7) (72 100 46) simpleGrading (1 1 1)
);
boundary	
(
		boundaries
	{
		type patch;
		faces
		(
			(2 6 5 1)
			(4 5 6 7)
			(1 5 4 0)
			(0 3 2 1)
			(0 4 7 3)
		);
	}

		top
	{
		type wall;
		faces
		(
			(3 7 6 2)
		);
	}

);
