OpenFOAM/reatorWALE_refined/0.ori/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    geo_100_mL_Wheel
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    cylinder_AMI1
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    cylinder_AMI2
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    Modified_100mL_Vessel
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
