OpenFOAM/reatorWALE_refined/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
	default	                        backward;
}
gradSchemes
{
	default	                        cellMDLimited Gauss linear 0.5;
}
divSchemes
{
    default none;
	div((nuEff*dev2(T(grad(U)))))	Gauss linear;
	div(R)	                        Gauss linear;
	div(phi,U)	                    Gauss linearUpwind grad(U);
	div(phi,CO2)                    Gauss limitedCubic01 1;
}
laplacianSchemes
{
	default	                        Gauss linear limited 0.777;
}
interpolationSchemes
{
	default	                        linear;
}
snGradSchemes
{
	default	                        limited 0.777;
}
fluxRequired
{
	default	no;
	p	;
}
wallDist
{
	method	meshWave;
	nRequired	false;
}
