OpenFOAM/reatorWALE_refined/system/fvOptions
//

FoamFile
{
    class dictionary;
    format ascii;
    location "system";
    object fvOptions;
    version 2.0;
}

 /*   limitU
    {
        type limitVelocity;
        active false;
    
        selectionMode   cellZone;
        cellZone        c0Zone;
        max 0.03;
    }
*/
