OpenFOAM/reatorWALE_refined/system/setFieldsDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	setFieldsDict;
}
regions	(
);
